# include <iostream>
using namespace std;
int main()
{
	int a,b,c; 
	int i [ 2 ] [ 3 ] = { { 1, 2, 3 }, { 4, 5, 6 } } ;
	int j [ 2 ] [ 3 ] = { 1, 2, 3, 4, 5, 6 } ;
	int k [ ] [ 2 ] [ 3 ] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 } ;
	int l [ ] [ 4 ] = { { 1 }, { 1 }, { 1 } } ;
//	int m [ 3 ] [ ] = { 1, 2, 3, 4, 5, 6 }; 数组定义错误，无法通过编译。 
	for (a=0;a<2;a++)
		for (b=0;b<3;b++)
			cout<<"i"<<"["<<a<<"]"<<"["<<b<<"]"<<"="<<i[a][b]<<endl;
		
	for (a=0;a<2;a++)
		for (b=0;b<3;b++)
			cout<<"j"<<"["<<a<<"]"<<"["<<b<<"]"<<"="<<j[a][b]<<endl;
		
	for (a=0;a<2;a++)
		for (b=0;b<2;b++)
			for (c=0;c<3;c++)
				cout<<"k"<<"["<<a<<"]"<<"["<<b<<"]"<<"["<<c<<"]"<<"="<<k[a][b][c]<<endl;
					
	for (a=0;a<3;a++)
		for (b=0;b<4;b++)
			cout<<"l"<<"["<<a<<"]"<<"["<<b<<"]"<<"="<<l[a][b]<<endl;
		
	cout<<"数组m[3][]定义错误,无法输出。"<<endl; 
	return 0;
} 
